In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
from sklearn.preprocessing import LabelEncoder

In [2]:
df=pd.read_csv("EasyVisa.csv")
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [3]:
df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  int64
 4   requires_job_training  25480 non-null  int64
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  int64
 11  case_status            25480 non-null  int64
dtypes: float64(1), int64(6), object(5)
memory usage: 2.3+ MB

In [4]:
df.describe()

       no_of_employees   yr_of_estab  prevailing_wage
count     25480.000000  25480.000000     25480.000000
mean       5667.043210   1979.409929     74455.814592
std       22877.928848     42.366929     52815.942327
min         -26.000000   1800.000000         2.136700
25%        1022.000000   1976.000000     34015.480000
50%        2109.000000   1997.000000     70308.210000
75%        3504.000000   2005.000000    107735.512500
max      602069.000000   2016.000000    319210.270000

In [6]:
continents = df['continent'].unique()
unit_OF_wage = df['unit_of_wage'].unique()
Region_of_employment=df['region_of_employment'].unique()
education_of_employee=df['education_of_employee'].unique()

print("total continents are", continents)
print("total unit of wage", unit_OF_wage)
print("total region of employment",Region_of_employment)
print("types of education_of_employee",education_of_employee)

total continents are ['Asia' 'Africa' 'North America' 'Europe' 'South America' 'Oceania']
total unit of wage ['Hour' 'Year' 'Week' 'Month']
total region of employment ['West' 'Northeast' 'South' 'Midwest' 'Island']
types of education_of_employee ['High School' "Master's" "Bachelor's" 'Doctorate']

In [7]:
le=LabelEncoder()
df['full_time_position']=le.fit_transform(df['full_time_position'])
df['case_status']=le.fit_transform(df['case_status'])
df['has_job_experience']=le.fit_transform(df['has_job_experience'])
df['requires_job_training']=le.fit_transform(df['requires_job_training'])
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,0,0,14513,2007,West,592.2029,Hour,1,1
1,EZYV02,Asia,Master's,1,0,2412,2002,Northeast,83425.6500,Year,1,0
2,EZYV03,Asia,Bachelor's,0,1,44444,2008,West,122996.8600,Year,1,1
3,EZYV04,Asia,Bachelor's,0,0,98,1897,West,83434.0300,Year,1,1
4,EZYV05,Africa,Master's,1,0,1082,2005,South,149907.3900,Year,1,0

In [8]:
df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience         int64
requires_job_training      int64
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position         int64
case_status                int64
dtype: object

In [9]:
df['unit_of_wage'].head()

0    Hour
1    Year
2    Year
3    Year
4    Year
Name: unit_of_wage, dtype: object